# Jointuire entre deux dataframes

In [1]:
import pandas as pd

In [8]:


maths = dict(
    studentId = [1, 2, 3],
    scoreMaths = [22, 66, 31],
)

machine_loearning = dict(
    studentId = [21, 8, 3],
    scoreML = [11, 85, 46],
)

df_maths = pd.DataFrame(maths)
df_ml = pd.DataFrame(machine_loearning)

In [9]:
df_maths

   studentId  scoreMaths
0          1          22
1          2          66
2          3          31

In [10]:
df_ml

   studentId  scoreML
0         21       11
1          8       85
2          3       46

# Inner, outer, right, left, cross joinure

In [19]:
df_maths.merge(df_ml, how="outer", on="studentId")

   studentId  scoreMaths  scoreML
0          1        22.0      NaN
1          2        66.0      NaN
2          3        31.0     46.0
3         21         NaN     11.0
4          8         NaN     85.0